{"data":{"site":{"siteMetadata":{"title":"Kevin Wilde","author":"Kevin Wilde"}},"markdownRemark":{"id":"efe7dc65-1f99-55e3-88e1-9a208cc46dec","excerpt":"TypeScript has exploded in popularity over the past couple years. If you asked a random developer why they think this has happened, they might say something…","html":"<p>TypeScript has exploded in popularity over the past couple years. If you asked a random developer why they think this has happened, they might say something about the value of static type-checking. It helps prevent bugs, it’s easier to understand code when you precisely know the shape of objects, it enables a better developer experience, it allows for greater confidence when refactoring, etc. These are all great benefits of using TypeScript, but in my opinion these benefits alone would not have been sufficient for TypeScript to become popular.</p>\n<p>A key feature of TypeScript is how easy it makes incremental migration of an existing JavaScript codebase. An incremental migration path is one of the most essential conditions for the successful adoption of a programming language, framework, library, or tool. React and GraphQL are two other examples of projects that grew quicklybecause they provided a good migration path.</p>\n<p>At Course Hero, we began using TypeScript a few years ago, slowly transitioning our frontend JavaScript code to TypeScript. Because we were transitioning existing JavaScript code, we set up our <code class=\"language-text\">tsconfig.json</code> to be “lenient”. <code class=\"language-text\">strictNullChecks</code> and <code class=\"language-text\">noImplicitAny</code> were both set to false. In an ideal world, or if you are starting a new TypeScript project from scratch, it is very useful to have these settings turned on. When they are off, TypeScript will allow the following code:</p>\n<div class=\"gatsby-highlight\" data-language=\"typescript\"><pre class=\"language-typescript\"><code class=\"language-typescript\"><span class=\"token keyword\">function</span> <span class=\"token function\">strLen</span><span class=\"token punctuation\">(</span>s<span class=\"token operator\">:</span> <span class=\"token builtin\">string</span><span class=\"token punctuation\">)</span><span class=\"token operator\">:</span> <span class=\"token builtin\">number</span> <span class=\"token punctuation\">{</span>\n    <span class=\"token keyword\">return</span> s<span class=\"token punctuation\">.</span>length\n<span class=\"token punctuation\">}</span>\n\n<span class=\"token function\">strLen</span><span class=\"token punctuation\">(</span><span class=\"token keyword\">null</span><span class=\"token punctuation\">)</span></code></pre></div>\n<p>Of course, this will result in an error at runtime. The point of using TypeScript is to catch type errors at build time! With <code class=\"language-text\">strictNullChecks</code> turned on, the TypeScript compiler will in fact catch this error and fail to compile your code.</p>\n<p>As I mentioned, though, we were migrating a significant amount of JavaScript code to TypeScript. We wanted to be able to start using TypeScript immediately without having to fix all of the places that would fail these stricter checks. Using a “lenient” <code class=\"language-text\">tsconfig.json</code> allowed us to start reaping some of the benefits of TypeScript immediately.</p>\n<p>After all of our non-legacy frontend code had been migrated to TypeScript, we decided that it should be a goal to turn on <code class=\"language-text\">strictNullChecks</code> and <code class=\"language-text\">noImplicitAny</code>. However, it wasn’t practical to try to change all the places that needed to be fixed at once. In a codebase as large as ours, there were thousands of errors when trying to compile with these stricter settings. We needed an incremental migration path!</p>\n<p>Our build process is set up in such a way that we can compile apps separately when doing local development, and then when we push to production, our CI will only compile the apps that have changed even though they are in a monolithic codebase. Because we have this per-app build process, we made a slight modification to allow each app to configure its own settings for <code class=\"language-text\">strictNullChecks</code> and <code class=\"language-text\">noImplicitAny</code>. This way those settings can be turned on one app at a time. It is much easier to get one app to comply with these stricter checks than to try to get all of our apps to comply.</p>\n<p>Each app has a small build config file (to configure a bundle name, entry point, and output path). This file is where we can configure <code class=\"language-text\">strictNullChecks</code> and <code class=\"language-text\">noImplicitAny</code> for just that app. To encourage apps to turn on these settings, an engineer added the following lines to all of our app config files:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">strictNullChecks: false, // TODO change to true\nnoImplicityAny: false, // TODO change to true</code></pre></div>\n<p>With that, we had an incremental migration path in place.</p>\n<p>Fast forward a year, and I started thinking about <code class=\"language-text\">strictNullChecks</code> and <code class=\"language-text\">noImplicitAny</code> again. I was working on an app that a different team had written, so I wasn’t very familiar with it, and it was frustrating to never be certain if an object really matched the type it had been annotated with or if it was <code class=\"language-text\">null</code>. I decided to check if we made any progress on moving towards <code class=\"language-text\">strictNullChecks</code> and <code class=\"language-text\">noImplicitAny</code>. Looking at our app config files, I found that a grand total of 0 of those <code class=\"language-text\">TODO change to true</code>s had been done.</p>\n<p>Our incremental migration path wasn’t working.</p>\n<p>Why didn’t this path work? One obvious reason stood out to me, and it has to do with IDEs. When writing TypeScript code, IDEs use <code class=\"language-text\">tsconfig.json</code> to determine what they should underline as an error. Since our <code class=\"language-text\">tsconfig.json</code> still had <code class=\"language-text\">strictNullChecks</code> and <code class=\"language-text\">noImplicitAny</code> set to false, people didn’t even realize when they were writing code that would fail these checks. Their IDE didn’t report any errors and the build task succeeded, so how could they know? This meant that rather than moving closer towards enabling <code class=\"language-text\">strictNullChecks</code> and <code class=\"language-text\">noImplicitAny</code>, we were actively adding code that was not compliant with <code class=\"language-text\">strictNullChecks</code> and <code class=\"language-text\">noImplicitAny</code>.</p>\n<p>As I thought about this, I began working on a different incremental migration strategy. First, we would set <code class=\"language-text\">strictNullChecks</code> and <code class=\"language-text\">noImplicitAny</code> to true in <code class=\"language-text\">tsconfig.json</code>, which would cause developers to become aware of the places that didn’t comply with these checks and hopefully allow them to comply with these checks perfectly when writing new code. During the build process, we would override these two settings with whatever value was configured for them in the app config file. This would allow all of our apps to still compile, while surfacing the errors to developers in their IDEs.</p>\n<p>Shortly after I put this strategy in place, a friend sent me this great <a href=\"https://code.visualstudio.com/blogs/2019/05/23/strict-null\">blog post from the VS Code team</a> about how they migrated to strict null checks. The basic approach is that they have a list of files that are already compliant with strict null checks. During the build process, they make sure that there are no regressions in any of these files.</p>\n<p>I realized that we could adopt this same strategy at Course Hero. The VS Code team wrote a couple scripts to automatically generate the list of files that are already compliant with strict null checks, and <a href=\"https://github.com/mjbvz/vscode-strict-null-check-migration-tools\">shared them on GitHub</a>. I forked these scripts and adapted them to the Course Hero codebase. I was able to generate a list of our own files that were already compliant with strict null checks and added a step to the build process to run the TypeScript compiler against this list of files. Now, we are able to prevent regressions against strict null checks by failing the build when a regression happens.</p>\n<p>By surfacing errors in the IDE and preventing regressions during the build process, we are having much more success at moving towards enabling <code class=\"language-text\">strictNullChecks</code> and <code class=\"language-text\">noImplicitAny</code>. We still aren’t there yet, but we’re making progress!</p>\n<h3>Update February 2021:</h3>\n<p>Using this approach, we have made significant progress towards reaching the point where our strictNullChecks and noImplicitAny can be enabled across our entire frontend codebase. Last year, we noticed the list of files that were already compliant with strict null checks had grown to be far larger than the list of files that were not compliant. We updated our fork of the VS Code strict null migration scripts to generate a list of files that are not compliant instead of a list of files that are compliant. Now newly-created files will be required to be compliant by default, whereas previously they had to be added to the list before they would be checked during CI.</p>\n<p>Today, we have only a handful of isolated areas in our frontend codebase that remain incompatible with strictNullChecks and noImplicitAny, in places that have been rarely touched over the past two years. The rest of the codebase has been migrated to these settings without ever having to dedicate a large chunk of time specifically to this effort. The migration proceeded in a natural way: as new files were added and existing files were updated, engineers would fix any issues that were shown in their IDE. Over time, these incremental changes have added up to a major improvement in the quality of our frontend codebase.</p>","frontmatter":{"title":"Incremental Migration","description":""}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/incremental-migration/","previous":{"fields":{"slug":"/classnamed-components/"},"frontmatter":{"title":"ClassNamed Components"}},"next":{"fields":{"slug":"/differences-in-output-of-typescript-compiler-and-babel-for-classes/"},"frontmatter":{"title":"Differences in output of Typescript compiler and Babel for classes"}}}}